import 'package:alnaiem/models/athkar_category.dart';
import 'package:alnaiem/models/sub_category_details.dart';

class CategoryUtil {
  List<AthkarCategory> athkars = new List<AthkarCategory>();

  CategoryUtil() {
    populateCategories();
  }

  void populateCategories() {
    athkars.add(
      new AthkarCategory(
        'أذكار الصباح',
        'assets/images/morningIcon.png',
        populateMorningAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار المساء',
        'assets/images/eveningIcon.png',
        populateEveningAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار النوم',
        'assets/images/sleepIcon.png',
        populateSleepingAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار الوضوء',
        'assets/images/ablutionIcon.jpg',
        populateAblutionAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار الأذان',
        'assets/images/prayersCallIcon.png',
        populatePrayerCallAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار الصلاة',
        'assets/images/prayIcon.png',
        populatePrayAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار ما بعد الصلاة',
        'assets/images/afterPrayIcon.png',
        populateAfterPrayAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار السفر',
        'assets/images/travelIcon.png',
        populateTravelAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار الخلاء',
        'assets/images/restroomIcon.png',
        populateRestroomAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار اللباس',
        'assets/images/clothIcon.png',
        populateClothAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار الطعام',
        'assets/images/forkIcon.png',
        populateFoodAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار الخروج من المنزل',
        'assets/images/outOfHomeIcon.png',
        populateOutOfHomeAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أذكار دخول المنزل',
        'assets/images/backToHomeIcon.png',
        populateBackToHomeAthkars(),
      ),
    );
    athkars.add(
      new AthkarCategory(
        'أدعية للميت',
        'assets/images/prayersForDeadIcon.png',
        populatePrayersForDeadAthkars(),
      ),
    );
//    athkars
//        .add(new AthkarCategory('أذكار المسجد', 'assets/images/morning.png'));
//    athkars.add(new AthkarCategory(
//        'أذكار الآمور العارضة', 'assets/images/morning.png'));
  }

  List<AthkarCategory> getCategories() {
    return this.athkars;
  }

  List<SubCategoryDetails> populateMorningAthkars() {
    List<SubCategoryDetails> morningAthkars = new List<SubCategoryDetails>();
    morningAthkars.add(
      new SubCategoryDetails(
          '(اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْن َ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ).',
          1,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          '(قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ).',
          3,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          '(قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ).',
          3,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          '(قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ).',
          3,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
          1,
          0),
    );

    morningAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْك النُّشُورُ.',
          1,
          0),
    );

    morningAthkars.add(
      new SubCategoryDetails(
          'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْت، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْت.َ',
          1,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَك، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.',
          4,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.',
          1,
          0),
    );

    morningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـت. اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ.',
          3,
          0),
    );

    morningAthkars.add(
      new SubCategoryDetails(
          'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.',
          7,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.',
          1,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.',
          1,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.',
          3,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـا.',
          3,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَين.',
          1,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم، فَـتْحَهُ، وَنَصْـرَه، وَنـورَهُ وَبَـرَكَتَـه، وَهُـداهُ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.',
          1,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِين.',
          1,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails('سُبْحـانَ اللهِ وَبِحَمْـدِه.', 100, 0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الملك وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.',
          100,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه.',
          3,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلاً.',
          1,
          0),
    );
    morningAthkars.add(
      new SubCategoryDetails('أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْه.ِ', 100, 0),
    );
    morningAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.',
          10,
          0),
    );
    return morningAthkars;
  }

  List<SubCategoryDetails> populateEveningAthkars() {
    List<SubCategoryDetails> eveningAthkars = new List<SubCategoryDetails>();
    eveningAthkars.add(
      new SubCategoryDetails(
          '(اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْن َ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ).',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          '(قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ).',
          3,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          '(قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ).',
          3,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          '(قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ).',
          3,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا، رَبِّ أَعـوذ ُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبر.',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ المصِير.',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ.',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.',
          4,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ. اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ.',
          3,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.',
          7,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ و َالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.',
          3,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـا.',
          3,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَين.',
          3,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'أَمْسَيْنا وَأَمْسَى الْملْكُ للهِ رَبِّ الْعَالميْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَها.',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.',
          1,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails('سُبْحـانَ اللهِ وَبِحَمْـدِه.', 100, 0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الملك وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.',
          100,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails('أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيهِ.', 100, 0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.',
          3,
          0),
    );
    eveningAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.',
          10,
          0),
    );
    return eveningAthkars;
  }

  List<SubCategoryDetails> populateSleepingAthkars() {
    List<SubCategoryDetails> sleepingAthkars = new List<SubCategoryDetails>();
    sleepingAthkars.add(
      new SubCategoryDetails(
          'يجمع كفيه ثم ينفث فيهما والقراءة فيهما‏:‏ ‏{قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَد‏}‏ و‏{قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَد}‏ و‏{قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاس}‏ ثم يمسح بهما ما استطاع من جسدهے يبدأ بهما على رأسه ووجه وما أقبل من جسده.',
          3,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          '(اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ   أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.)',
          1,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          '(آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالمؤمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ المصيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.)',
          1,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          'بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.',
          1,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها، إِنْ أَحْيَيْـتَها فاحْفَظْـها، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها. اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة.',
          1,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك.', 3, 0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails('بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا.', 1, 0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails('سُبْحَانَ اللَّهِ.', 33, 0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails('الْحَمْدُ لِلَّهِ.', 33, 0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails('اللَّهُ أَكْبَرُ.', 34, 0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          ' اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ.',
          1,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          'الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي.',
          1,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.',
          1,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          'يقرأ: {الم، تَنْزِيلُ الْكِتَابِ لَا رَيْبَ فِيهِ مِنْ رَبِّ الْعَالَمِينَ} سورة السّجدة و{تَبَارَكَ الَّذي بيَده الْمُلْك} سورة الْمُلْك.',
          1,
          0),
    );
    sleepingAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت.',
          1,
          0),
    );
    return sleepingAthkars;
  }

  List<SubCategoryDetails> populateAblutionAthkars() {
    List<SubCategoryDetails> ablutionAthkars = new List<SubCategoryDetails>();
    ablutionAthkars.add(
      new SubCategoryDetails('الذكر قبل الوضوء: بِسْمِ ٱلله.ّٰ', 1, 0),
    );
    ablutionAthkars.add(
      new SubCategoryDetails(
          'الذكر بعد الوضوء: أشْهَدُ أن لا إله إلا الله وحْدَهُ لا شريكَ له، وأشْهَدُ أنَّ محمداً عَبدُهُ ورسُولُه.',
          1,
          0),
    );
    ablutionAthkars.add(
      new SubCategoryDetails(
          'الذكر بعد الوضوء: اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ.',
          1,
          0),
    );
    ablutionAthkars.add(
      new SubCategoryDetails(
          'الذكر بعد الوضوء: سُبْحَانَكَ اللَّهُمَّ وبَحَمْدكَ أشْهدُ أنْ لا إلهَ إلا أنْتَ أَسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ.',
          1,
          0),
    );
    return ablutionAthkars;
  }

  List<SubCategoryDetails> populatePrayerCallAthkars() {
    List<SubCategoryDetails> prayerCallAthkars = new List<SubCategoryDetails>();
    prayerCallAthkars.add(
      new SubCategoryDetails(
          'يَقُولُ مثل ما يَقُولُ الـمُؤَذِّنُ إلاَّ فِي "حَيَّ عَلَى الصَّلاةِ وَحَيَّ عَلَى الفَلاَحِ" فَيَقُولُ: "لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ".',
          1,
          0),
    );
    prayerCallAthkars.add(
      new SubCategoryDetails(
          'يَقُولُ: وأنا أَشْهَد أَنْ لا إِله إِلاَّ اللَّه وحْدهُ لا شَريك لهُ، وَأَنَّ مُحمَّداً عبْدُهُ وَرسُولُه، رضِيتُ بِاللَّهِ ربًّا، وبمُحَمَّدٍ رَسُولاً، وبالإِسْلامِ دِينًاُ" يقول ذلك عقب تشهد المؤذن.',
          1,
          0),
    );
    prayerCallAthkars.add(
      new SubCategoryDetails(
          'يصلي على النبي صلى الله عليه وسلم بعد فراغه من إجابة المؤذنُ".',
          1,
          0),
    );

    prayerCallAthkars.add(
      new SubCategoryDetails(
          'يَقُولُ: اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، والصَّلاةِ القَائِمَةِ، آتِ مُـحَمَّداً الوَسِيْلَةَ والفَضِيْلَةَ، وابْعَثْهُ مَقَاماً مَـحْمُوداً الَّذِي وَعَدْتَهُ، إنَّكَ لا تُخْلِفُ الـمِيْعَادِ.',
          1,
          0),
    );
    prayerCallAthkars.add(
      new SubCategoryDetails(
          'يدعو لنفسه بَيْنَ الأَذَانِ وَالْإِقَامَة فإِنَّ الدُّعَاءَ حينئذٍ لَا يُرَدُّ.',
          1,
          0),
    );
    return prayerCallAthkars;
  }

  List<SubCategoryDetails> populatePrayAthkars() {
    List<SubCategoryDetails> prayAthkars = new List<SubCategoryDetails>();
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية استفتاح الصلاة: اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ   الْمشرِقِ وَالمغْرِبِ، اللهم نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأبْيَضُ مِنَ الدَّنَسِ، اللهم اغْسِلْنِيْ مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ والْبَرَدِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية استفتاح الصلاة: سُبْحَانَكَ سُبْحَانَكَ اللهم وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية استفتاح الصلاة: الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية استفتاح الصلاة: اللهُ أكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَّاصِيْلًا. أعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية استفتاح الصلاة: اللَّهُمَّ رَبَّ جَبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيْلَ، فَاطِرَ السَّمَوَاتِ وَالْأرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَة،ِ أنْتَ تَحْكُمُ بَيْنَ   عِبَادِكَ فِيْمَا كَانُوا فِيْهِ يَخْتَلِفُونَ، اِهْدِنِيْ لما اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية استفتاح الصلاة: وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَوَاتِ وَالْأرْضَ حَنِيْفًا وَّمَا أنَا مِنَ المشركينَ، إِنَّ صَلَاتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلهِ رَبِّ الْعالمينَ، لَا شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَانَا مِنَ المسلمينَ، اللهم أنْتَ الملِكُ لَا إِلَهَ إِلَّا أنْتَ، أنْتَ رَبِّيْ وَأنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لَا يَغْفِرُ الذُّنوبَ إِلَّا أنْتَ. وَاهْدِنِيْ لِأحْسَنِ الْأخْلَاقِ لَا يَهْدِيْ لِأحْسَنِهَا إِلَّا أنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أسْتَغْفِرُكَ وَأتُوْبُ إِلَيْكَ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الركوع: سُبْحَانَ رَبِّيَ العَظِيمِ وَبِحَمْدِهِ.', 3, 0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الركوع: سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الركوع: سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلَائِكَةِ وَالرُّوْحِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الركوع: سُبْحَانَ ذِيْ الْجَبَرُوْتِ، وَالْملكوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الركوع: اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي وَبَصَرِي، وَمُخِّي وَعَظْمِي وَعَصَبِي.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الرفع من الركوع: سَمِعَ اللهُ لمنْ حَمِدَهُ.', 1, 0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الرفع من الركوع: رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبارَكًا فِيْهِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الرفع من الركوع: اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ اسْلَمْتُ، خَشَعَ لَكَ سَمْعِيْ، و بَصَـرِيْ، وَمُخِّيْ، وَعَظْمِيْ، وَعَصَبِيْ، وَمَا استَقَلَّتْ بِهِ قَدَمِيْ لِلهِ رَبِّ العالمين.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الرفع من الركوع: اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْارْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، أهْلَ الثَّنَاءِ والمجد، أحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ، اللهم لَا مَانِعَ لما أعْطَيْتَ، وَلَا مُعْطِيَ لما مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الْجَدُّ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الرفع من الركوع: اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ، وَمِلْءَ الْارْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ، والماء الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْابْيَضُ مِنَ الْوَسَخِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: سُبْحَانَ رَبِّيَ الأعْلَى وَبِحَمْدِهِ.', 3, 0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: سُبُّوحٌ قُدُّوسٌ رَبُّ الملائكةِ وَالرُّوحِ.', 1, 0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: سُبْحَانَ ذِي الْجَبْرُوتِ والملكوت وَالْكِبْرِيَاءِ وَالْعَظَمَةِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: اللَّهُمَّ لَكَ سَجَدْتُّ وَبِكَ آمَنْتُ، وَلَكَ أسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِيْ خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ أحْسَنُ الخالقين.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: اللَّهُمَّ إِنِّيْ أعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لَا أُحْصِـي ثَنَاءً عَلَيْكَ، أنْتَ كَمَا أثْنَيْتَ عَلَى نَفْسِكَ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: رَبِّ اعْطِ نَفْسِي تَقْوَاهَا زَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا أنْتَ وَلِيُّهَا وَمَوْلَاهَا.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية السجود: اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًاُ، وَاجْعَلْ فِيْ سَمْعِيْ نُورًاُ، وَاجْعَلْ فِيْ بَصَرِيْ نُورًاُ، وَاجْعَلْ مِنْ تَحْتِي نُورًاُ، وَاجْعَلْ مِنْ فَوْقِي نُورًاُ، وَعَنْ يَمِينِي نُورًاُ، وَعَنْ يَسَارِي نُورًاُ، وَاجْعَلْ أمَامِي نُورًاُ، وَاجْعَلْ خَلْفِي نُورًاُ، وَأعْظِمْ لِيْ نُورًا.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية الجلوس بين السجدتين: رَبِّ رَبِّ اغْفِرْ لِيْ، رَبِّ اغْفِرْ لِيْ. \n اللَّهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَاهْدِنِيْ، وَاجْبُرْنِيْ، وَعَافِنِيْ، وَارْزُقْنِيْ، وَارْفَعْنِيْ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'دعاء سجود التلاوة: سَجَدَ وَجْهِيَ للَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللَّهُ أَحْسَنُ الْـخَالِقِينَ.\n اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أجْراً، وَضَعْ عَنِّي بِهَا وِزْرَاً، واْجعَلْهَا لِي عِنْدِكَ ذُخْراً، وتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'التشهد الأول: التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَات،ُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُه،ُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِين، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّه،ُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'التشهد الأخير: التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَات،ُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.\n اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدً، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ المسيح الدَّجَّالِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ المحيا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ المأثم والمغرم.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيرا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ. وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ. وَمَا أَسْرَفْتُ. وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ المقدم وَأَنْتَ الْمُؤَخِّرُ. لاَ إِلهَ إِلاَّ أَنْتَ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ إِنِّيْ أسْألُكَ يَا أللهُ بِأنَّكَ الْوَاحِدُ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ، وَلَمْ يَكنْ لَهُ كُفُوًا أحَدٌ، أنْ تَغْفِرَ لِيْ ذُنُوْبِيْ إِنَّكَ أنْتَ الْغَفُوْرُ الرَّحِيْمُ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ حَاسِبْنِيْ حِسَابَاً يَسِيراً.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّ لَكَ الْحَمْدُ لَا إِلَهَ إِلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، المنان، يَا بَدِيعَ السَّمَوَاتِ وَالْارْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّيْ أشْهَدُ أنَّكَ أنْتَ اللهُ لَا إِلَهَ إِلَّا أنْتَ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أحَدٌ.',
          1,
          0),
    );
    prayAthkars.add(
      new SubCategoryDetails(
          'أدعية بعد التشهد الأخير وقبل السلام: اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِيْ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِيْ، اللهم إِنِّيْ أسْألُكَ خَشْيَتَكَ فِيْ الْغَيْبِ وَالشَّهَادَةِ، وَأسْألُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأسْألُكَ الْقَصْدَ فِيْ الْغِنَى وَالْفَقْرِ، وَأسْألُكَ نَعِيْمًا لَا يَنْفَدُ، وَأسْألُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأسْألُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأسْألُكَ بَرْدَ الْعَيْشِ بَعْدَ الموت، وَأسْألُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللهم زَيِّنَّا بِزِينَةِ الْإِيْمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِيْنَ.',
          1,
          0),
    );
    return prayAthkars;
  }

  List<SubCategoryDetails> populateAfterPrayAthkars() {
    List<SubCategoryDetails> afterPrayAthkars = new List<SubCategoryDetails>();
    afterPrayAthkars.add(
      new SubCategoryDetails(
          'أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله. اللّهُـمَّ أَنْـتَ السَّلامُ، وَمِـنْكَ السَّلام، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام.',
          1,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          'لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.',
          1,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          'لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.',
          1,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          'سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر.', 33, 0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.',
          1,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          '(قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ).',
          1,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          '(قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ).',
          1,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          '(قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ).',
          1,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          '(اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ   أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ).',
          1,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          '(لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير)(10 عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح).',
          10,
          0),
    );
    afterPrayAthkars.add(
      new SubCategoryDetails(
          'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـبا، وَعَمَـلاً مُتَقَـبَّلاً (1 بَعْد السّلامِ من صَلاةِ الفَجْر).',
          1,
          0),
    );
    return afterPrayAthkars;
  }

  List<SubCategoryDetails> populateTravelAthkars() {
    List<SubCategoryDetails> travelAthkars = new List<SubCategoryDetails>();
    travelAthkars.add(
      new SubCategoryDetails(
          'الله أكبر، الله أكبر، الله أكبر، (سُبْحانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لمنقلبون) اللهم إنا نسألُكَ في سفرنا هذا البرَّ والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا واطو عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعْثاءِ السفر، وكآبة المنظر، وسوء المنقلب في المال والأهل، وإذا رجع قالهن وزاد فيهن آيبون، تائبون، عابدون، لربنا حامدون',
          1,
          0),
    );
    travelAthkars.add(
      new SubCategoryDetails(
          'ذكر الرجوع من السفر: يُكَبِّرُ عَلَى كُلِّ شَرَفٍ ثَلاثَ تَكْبيرَاتٍ، ثُمَّ يَقُولُ: لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ الـمُلْكُ ولَهُ الـحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيرٌ، آيبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وهَزَمَ الأحْزَابَ وَحْدَه.',
          1,
          0),
    );
    return travelAthkars;
  }

  List<SubCategoryDetails> populateRestroomAthkars() {
    List<SubCategoryDetails> restroomAthkars = new List<SubCategoryDetails>();
    restroomAthkars.add(
      new SubCategoryDetails(
          'الذكر عند الخلاء: (بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث.',
          1,
          0),
    );
    restroomAthkars.add(
      new SubCategoryDetails('الذكر بعد الخروج من الخلاء: غُفْـرانَك.', 1, 0),
    );
    return restroomAthkars;
  }

  List<SubCategoryDetails> populateClothAthkars() {
    List<SubCategoryDetails> clothAthkars = new List<SubCategoryDetails>();
    clothAthkars.add(
      new SubCategoryDetails(
          'مَنْ لَبِسَ ثَوْبًا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ)  وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ.',
          1,
          0),
    );
    clothAthkars.add(
      new SubCategoryDetails(
          'دعاء لبس الثوب الجديد: اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيه، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَه، وَأَعُوذُ بِكَ مِنْ شَرِّه و شَرِّ مَا صُنِعَ لَه.',
          1,
          0),
    );
    clothAthkars.add(
      new SubCategoryDetails(
          'الدعاء لم لبس ثوبا جديدا: تُبْلي ويَخْلِفُ الله تعالى.', 1, 0),
    );
    clothAthkars.add(
      new SubCategoryDetails(
          'الدعاء لم لبس ثوبا جديدا: الْبَسْ جَدِيدًا، وَعِشْ حَمِيدًا، وَمُتْ شَهِيدًا.',
          1,
          0),
    );
    clothAthkars.add(
      new SubCategoryDetails('ما يقول إذا وضع ثوبا جديدا: بسم الله.', 1, 0),
    );
    return clothAthkars;
  }

  List<SubCategoryDetails> populateFoodAthkars() {
    List<SubCategoryDetails> foodAthkars = new List<SubCategoryDetails>();
    foodAthkars.add(
      new SubCategoryDetails(
          'إِذَا أَكَلَ أَحَدكُمْ الطَعَام فَلْيَقُلْ بِسْمِ اللَّه، فَإِنْ نَسِيَ فِي أَوَّله فَلْيَقُلْ: بِسْمِ اللَّه فِي أَوَّله وَآخِره.',
          1,
          0),
    );
    foodAthkars.add(
      new SubCategoryDetails(
          'مَنْ أطْعَمَهُ اللهُ الطَّعَامَ؛ فَلْيَقُلْ: اللَّهُمَّ بَارِكْ لَنـَا فِيْهِ، وأطْعِمْنَا خَيْراً مِنْهُ، ومَنْ سَقَاهُ اللهُ لَبَناً فَلْيَقُلْ: اللَّهُمَّ بَارِكْ لَـنَا فِيْهِ، وَزِدْنَا مِنْه.',
          1,
          0),
    );
    foodAthkars.add(
      new SubCategoryDetails(
          'الدعاء عند الفراغ من الطعام: الحمد لله الذي أطعمني هذا ،وزرقنيه ،من غير حول مني ولا قوة.',
          1,
          0),
    );
    foodAthkars.add(
      new SubCategoryDetails(
          'الدعاء عند الفراغ من الطعام: الحمدُ لله حمداً كثيراً طيباً مباركاً فيهِ، غيْرَ [مَكْفيٍّ ولا] مُوَدَّع، ولا مُستَغنَى عَنْهُ ربّنا.',
          1,
          0),
    );
    foodAthkars.add(
      new SubCategoryDetails(
          'دعاء الضيف لصاحب الطعام: اللهُمَّ بَارِكْ لَهُم فيما رَزَقتهْمْ، واغْفِر لهم وارحَمْهُم.',
          1,
          0),
    );
    return foodAthkars;
  }

  List<SubCategoryDetails> populateOutOfHomeAthkars() {
    List<SubCategoryDetails> outOfHomeAthkars = new List<SubCategoryDetails>();
    outOfHomeAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إِنِّي أعوذُ بِكَ أنْ أَضِلَّ أو أُضَلَّ، أَوْ أَزِلَّ أوْ أُزلَّ، أوْ أظلِمَ أوْ أُظلَم، أوْ أَجْهَلَ أو يُجهَلَ عَلَيَّ.',
          1,
          0),
    );
    outOfHomeAthkars.add(
      new SubCategoryDetails(
          'بِسْم اللَّهِ توكَّلْتُ عَلَى اللَّه، ولا حوْلَ ولا قُوةَ إلاَّ بِاللَّهُ.',
          1,
          0),
    );
    return outOfHomeAthkars;
  }

  List<SubCategoryDetails> populateBackToHomeAthkars() {
    List<SubCategoryDetails> backToHomeAthkars = new List<SubCategoryDetails>();
    backToHomeAthkars.add(
      new SubCategoryDetails(
          'َبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا، ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِه.',
          1,
          0),
    );
    return backToHomeAthkars;
  }

  List<SubCategoryDetails> populatePrayersForDeadAthkars() {
    List<SubCategoryDetails> prayersForDeadAthkars =
        new List<SubCategoryDetails>();
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ أبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وأدخله الجنّة، وأعذه من عذاب القبر ومن عذاب النّار.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ عامله بما أنت أهله، ولا تعامله بما هو أهله.', 1, 0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ اجزه عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إن كان محسناً فزد من حسناته، وإن كان مسيئاً فتجاوز عن سيّئاته.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ أدخله الجنّة من غير مناقشة حساب ولا سابقة عذاب.', 1, 0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ آنسه في وحدته وفي وحشته وفي غربته.', 1, 0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ أنزله منزلاً مباركاً وأنت خير المنزلين.', 1, 0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ أنزله منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ أعذه من عذاب القبر، وجفاف ِالأرض عن جنبيها.', 1, 0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ املأ قبره بالرّضا والنّور والفسحة والسّرور.', 1, 0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّه في ذمّتك وحبل جوارك، فقِهِِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه إنّك أنت الغفور الرّحيم.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّه عبدك وابن عبدك خرج من الدّنيا وسعتها ومحبوبها وأحبّائه فيها إلى ظلمة القبر وما هو لاقيه.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّه كان يشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السؤال.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّه نَزَل بك وأنت خير منزولٍ به، وأصبح فقيراً إلى رحمتك وأنت غنيٌّ عن عذابه.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ انقله من مواطن الدّود وضيق اللحود إلى جنّات الخلود.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ احمه تحت الأرض، واستره يوم العرض، ولا تخزه يوم يبعثون (يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم).',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم).',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ أمّنه من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسه آمنة مطمئنّة، ولقّنه حجّته.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ اجعله في بطن القبر مطمئنّاً وعند قيام الأشهاد آمن، وبجود رضوانك واثق، وإلى أعلى درجاتك سابق.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ اجعل عن يمينه نوراً حتّى تبعثه آمناً مطمئنّاً في نورٍ من نورك.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ انظر إليه نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ اعف عنه فإنّك القائل "ويعفو عن كثير".', 1, 0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّه جاء ببابك، وأناخ بجنابك، فَجد عليه بعفوك وإكرامك وجود إحسانك.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمه رحمةً تطمئنّ بها نفسه، وتقرّ بها عينه.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ احشره مع المتّقين إلى الرّحمن وفداً.', 1, 0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ احشره مع أصحاب اليمين، واجعل تحيّته سلامٌ لك من أصحاب اليمين.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ بشّره بقولك "كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية".',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ اجعله من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ لا نزكّيه عليك، ولكنّا نحسبه أنّه أمن وعمل صالحاً، فاجعل له جنّتين ذواتي أفنان بحقّ قولك: "ولمن خاف مقام ربّه جنّتان".',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ شفع فيه نبيّنا ومصطفاك، واحشره تحت لوائه، واسقه من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً.',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ اجعله في جنّة الخلد "الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا".',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّه صبر على البلاء فلم يجزع، فامنحه درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل "إنّما يوفي الصّابرون أجرهم بغير حساب".',
          1,
          0),
    );
    prayersForDeadAthkars.add(
      new SubCategoryDetails(
          'اللَّهُمَّ إنّه كان مصلّ لك، فثبّته على الصّراط يوم تزل الأقدام.',
          1,
          0),
    );
    return prayersForDeadAthkars;
  }
}
